In [ ]:
#Social_Network_Ads.csv

**Import libraries**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

**Importing the dataset**

In [2]:
df = pd.read_csv('Social_Network_Ads.csv')

In [3]:
df.shape

(400, 5)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [5]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

**Splitting the dataset into the Training set and Test set**

In [6]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

**Feature Scaling**

In [7]:
from sklearn.preprocessing import OneHotEncoder

df['Gender']=df['Gender'].astype('category')
df['gender']=df['Gender'].cat.codes

In [8]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  gender
0  15624510    Male   19            19000          0       1
1  15810944    Male   35            20000          0       1
2  15668575  Female   26            43000          0       0
3  15603246  Female   27            57000          0       0
4  15804002    Male   19            76000          0       1

In [9]:
df = df.drop(columns=['User ID','Gender'])

In [10]:
column = df.pop('Purchased')

In [11]:
df.insert(3, 'Purchased', column)

In [12]:
df.head()

   Age  EstimatedSalary  gender  Purchased
0   19            19000       1          0
1   35            20000       1          0
2   26            43000       0          0
3   27            57000       0          0
4   19            76000       1          0

In [13]:
df.isnull().sum()

Age                0
EstimatedSalary    0
gender             0
Purchased          0
dtype: int64

**Fitting SVM to the Training set**

In [14]:
x = df.iloc[:,0:3]
x

     Age  EstimatedSalary  gender
0     19            19000       1
1     35            20000       1
2     26            43000       0
3     27            57000       0
4     19            76000       1
..   ...              ...     ...
395   46            41000       0
396   51            23000       1
397   50            20000       0
398   36            33000       1
399   49            36000       0

[400 rows x 3 columns]

In [15]:
y = df.iloc[:,3]
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [16]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.20,random_state = 8)

In [17]:
from sklearn.preprocessing import StandardScaler #Standardization
func = StandardScaler()
func.fit(x_train)
x_train = func.transform(x_train)
x_test = func.transform(x_test)

print(f'shape of x_train : {x_train.shape}')
print(f'shape of y_train : {y_train.shape}')
print(f'shape of x_test : {x_test.shape}')
print(f'shape of y_test : {y_test.shape}')

shape of x_train : (320, 3)
shape of y_train : (320,)
shape of x_test : (80, 3)
shape of y_test : (80,)

In [18]:
from sklearn.svm import SVC
from sklearn.model_selection import cross_val_score,KFold


model = SVC()

kfold = KFold(n_splits = 5)
scores = cross_val_score(model,x,y,cv = kfold)


print(f'The cross validation scores for SVC model is:{scores}',end = '\n\n')
print(f'The mean of cross_val_scores:{scores.mean()}',end = '\n\n')

model.fit(x_train,y_train)

print(f'Train score:{format(model.score(x_train,y_train))}',end = '\n\n')
print(f'Test score:{format(model.score(x_test,y_test))}',end = '\n\n')

The cross validation scores for SVC model is:[0.8125 0.975  0.8875 0.6125 0.525 ]

The mean of cross_val_scores:0.7625

Train score:0.90625

Test score:0.9125

In [21]:
preds_tr = model.predict(x_train)
preds_tr

array([0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0,
       0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0,
       1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1,
       0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1], dtype=int64)

**Predicting the Test set results**

In [ ]:
preds = model.predict(x_test)
preds

**Making the Confusion Matrix**

In [ ]:
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix,accuracy_score

print("Accuracy of SVC model is: ",accuracy_score(y_test,preds))
print("SVC model Classification report: ","\n",classification_report(y_test,preds))
print("Confusion matrix for SVC model:","\n",confusion_matrix(y_test,preds))

**Visualising the Training set results**

**Visualising the Test set results**